15-11-2021/app/controllers/products_controller.rb

SELECT "products".* FROM "products" WHERE (title LIKE '%1%')
SELECT "products".* FROM "products" WHERE "products"."title" IN (?, ?) ORDER BY created_at desc LIMIT ? OFFSET ?  [["title", "Ao"], ["title", "123"], ["LIMIT", 3], ["OFFSET", 0]]
SELECT COUNT(*) FROM "products" WHERE (title LIKE '%a%')
---
    def index
      if params[:query]
        product_search = Product.where("title LIKE ?", "%" + params[:query] + "%")
        @product_list = product_search.paginate(page: params[:page], per_page: 3).order('created_at desc')

INSERT INTO "products" ("sku", "title", "price", "quantity", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["sku", "abc"], ["title", "23423"], ["price", 23423.0], ["quantity", 23423], ["image", "23423"], ["created_at", "2021-11-17 02:19:11.894166"], ["updated_at", "2021-11-17 02:19:11.894166"]]
---
    def create
      @product  = Product.new(product_params)
      if @product .save

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
UPDATE "products" SET "quantity" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["quantity", 4], ["updated_at", "2021-11-18 08:44:52.719065"], ["id", 16]]
---
    def update
      @product = Product.find(params[:id])
      if @product.update(product_params)